class Language:
    intro: tuple[str] = (
        "Привет, абитуриент!\n\n"
        "Я твой новый нейросетевой репетитор. Я могу спланировать твою "
        "подготовку к экзаменам.  Сейчас я помогаю только с ЕГЭ по русскому, "
        "информатике и математике, однако я развиваюсь так же, как и ты\n\n"
        "Что бы узнать больше напиши /about\n\n"
        "Готов приступить к занятиям? Тогда выбери предмет для подготовки!",
    )
    about: tuple[str] = (
        "Наш продукт (Репетитор на основе ИИ) -  объективно лучший выбор "
        "учащегося для подготовки к математике и русскому языку на любом уровне. "
        "Материалы для подготовки и младшеклассников, и докторов будут лежать в "
        "доступе на разных разделах нашего сайта.\n"
        "Для всех пользователей будет доступно тестирование с определением "
        "текущего уровня знаний и последующим умным категориальным подходом. А "
        "для пользователей с премиум подпиской будет доступно особое "
        "тестирование с разносторонней оценкой знания и генерацией индивидуальных материалов.",
    )
